ХМНПФ_Общее/Documents/уп_ОтказыПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ОтказыПФР</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ6</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ7</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ8</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ9</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ10</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ11</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ12</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отказ15</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_Отказ15</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговораОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияДоговоровОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговоровОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияДоговоровОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПодтвержденияПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеПоступленияВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриостановленПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбязательстваВыполнены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_Анулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПричиныЗакрытияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АннулированиеЛицензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВступилВСилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоРешениюСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходДосрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоИнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъединениеСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПереносСредствНаДругойДоговорФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НазначенаВыплатаПредыдущимСтраховщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/ХМ_ПричиныОтказаПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_ПричиныОтказаПФР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отказ15</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ОтказыПФР/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 30.05.2018 КлименкоМИ // ОбработкаПроведения() // №1646	
	// ХМНПФ 30.05.2018 КлименкоМИ // новая процедура ХМ_ДобавитьПроводкиПоРСХМ_ПричинаОтказаПФР() // №1646	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	//проверим чтобы не было уже закрытых договоров
	Отказ = ПроверитьЗакрытые(Заголовок);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, Ответственный");
	уп_ОсновнаяПоставкаСервер.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ДоговорОПС");
	ТЗ.Колонки.Добавить("Отказ1",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ2",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ3",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ4",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ5",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ6",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ7",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ8",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ9",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ10",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ11",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ12",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Отказ15",Новый ОписаниеТипов("Число"));
	
	Для Каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
		НовСтр = ТЗ.Добавить();
		НовСтр.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
		Если ТекСтрокаДоговорыОПС.Отказ1 Тогда
			НовСтр.Отказ1 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ2 Тогда
			НовСтр.Отказ2 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ3 Тогда
			НовСтр.Отказ3 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ4 Тогда
			НовСтр.Отказ4 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ5 Тогда
			НовСтр.Отказ5 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ6 Тогда
			НовСтр.Отказ6 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ7 Тогда
			НовСтр.Отказ7 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ8 Тогда
			НовСтр.Отказ8 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ9 Тогда
			НовСтр.Отказ9 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ10 Тогда
			НовСтр.Отказ10 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ11 Тогда
			НовСтр.Отказ11 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ12 Тогда
			НовСтр.Отказ12 = 1;
		КонецЕсли;
		Если ТекСтрокаДоговорыОПС.Отказ15 Тогда
			НовСтр.Отказ15 = 1;
		КонецЕсли; 
		#Вставка
		//+ ХМНПФ 30.05.2018 КлименкоМИ // ОбработкаПроведения() // №1646
		Если ТекСтрокаДоговорыОПС.ХМ_Отказ15 Тогда
			НовСтр.Отказ15 = 1;
		КонецЕсли;
		//- ХМНПФ 30.05.2018 КлименкоМИ // ОбработкаПроведения() // №1646
		#КонецВставки
	КонецЦикла;	
	
	ТЗ.Свернуть("ДоговорОПС","Отказ1,Отказ2,Отказ3,Отказ4,Отказ5,Отказ6,Отказ7,Отказ8,Отказ9,Отказ10,Отказ11,Отказ12,Отказ15");
	
	Для каждого ТекСтр из ТЗ Цикл
		
		Если ТекСтр.Отказ1 + ТекСтр.Отказ2 +ТекСтр.Отказ3 + ТекСтр.Отказ4 + ТекСтр.Отказ5 + ТекСтр.Отказ6 + ТекСтр.Отказ7 + ТекСтр.Отказ8 + 
			ТекСтр.Отказ9 + ТекСтр.Отказ10 + ТекСтр.Отказ11 + ТекСтр.Отказ12 + ТекСтр.Отказ15 = 0 Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У договора ОПС " + ТекСтр.ДоговорОПС.Код + " не выбрано ни одного кода ошибки!",,Заголовок);
			Продолжить;
		КонецЕсли;
		
		ДобавлятьСостояние = Истина;

		Если Дата<'20060101000000' И ТекСтр.Отказ7>0  и (ТекСтр.Отказ1+ТекСтр.Отказ2+ТекСтр.Отказ3+ТекСтр.Отказ4+ТекСтр.Отказ5+ТекСтр.Отказ6+ТекСтр.Отказ8) = 0 Тогда
			
			лНовоеСостояние = Перечисления.уп_СостоянияДоговоровОПС.ПриостановленПоОтказуИзПФР;
			
		ИначеЕсли Дата>='20060101000000' И (ТекСтр.Отказ1 > 0 Или ТекСтр.Отказ2 > 0 Или ТекСтр.Отказ15 > 0) И 
			(ТекСтр.Отказ3 + ТекСтр.Отказ4 + ТекСтр.Отказ5 + ТекСтр.Отказ6 + ТекСтр.Отказ7 + ТекСтр.Отказ8 + ТекСтр.Отказ9 + ТекСтр.Отказ10 + ТекСтр.Отказ11 + ТекСтр.Отказ12) = 0 Тогда
			
			//надо сверить текущее состояние
			ТекСостояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата,Новый Структура("ДоговорОПС", ТекСтр.ДоговорОПС)).Состояние;
			Если ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
				лНовоеСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
			Иначе
				лНовоеСостояние = Перечисления.уп_СостоянияДоговоровОПС.ПриостановленПоОтказуИзПФР;
			КонецЕсли;
		Иначе
			лНовоеСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
		КонецЕсли;
		
		Если ДобавлятьСостояние Тогда
			// регистр СостоянияДоговораОПС 
			Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтр.ДоговорОПС;
			Движение.Состояние = лНовоеСостояние;
		КонецЕсли;
		
		Если лНовоеСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда 
			//надо сверить причины закрытия
			ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияДоговоровОПС.ПолучитьПоследнее(Дата,Новый Структура("ДоговорОПС", ТекСтр.ДоговорОПС)).ПричинаЗакрытия;
			
			Если НЕ (ЗначениеЗаполнено(ТекПричина)) Тогда
				// регистр ПричиныЗакрытияДоговоровОПС 
				Движение = Движения.уп_ПричиныЗакрытияДоговоровОПС.Добавить();
				Движение.Период = Дата;
				Движение.ДоговорОПС = ТекСтр.ДоговорОПС;
				Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ЗакрытПоОтказуИзПФР;
			Иначе
				Если ТекПричина<>Перечисления.уп_ПричиныЗакрытияДоговораОПС.ЗакрытПоОтказуИзПФР Тогда
					Отказ = Истина;
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У договора ОПС "+ТекСтр.ДоговорОПС.Код+" уже установлена причина закрытия, "+ТекПричина+". Невозможно установить другую причину закрытия.",,Заголовок);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	// записываем движения регистров
	#Вставка
	//+ ХМНПФ 30.05.2018 КлименкоМИ // ОбработкаПроведения() // №1646	
	ХМ_ДобавитьПроводкиПоРСХМ_ПричинаОтказаПФР();
	//- ХМНПФ 30.05.2018 КлименкоМИ // ОбработкаПроведения() // №1646
	#КонецВставки
	Движения.уп_СостоянияДоговораОПС.Записать();
	Движения.уп_ПричиныЗакрытияДоговоровОПС.Записать();
КонецПроцедуры

//+ ХМНПФ 30.05.2018 КлименкоМИ // новая процедура ХМ_ДобавитьПроводкиПоРСХМ_ПричинаОтказаПФР() // №1646
Процедура ХМ_ДобавитьПроводкиПоРСХМ_ПричинаОтказаПФР()
	Тз =  ДоговорыОПС.Выгрузить();
	Тз.Свернуть("ДоговорОПС","ХМ_Отказ15,Отказ1,Отказ2,Отказ3,Отказ4,Отказ5,Отказ6,Отказ7,Отказ8,Отказ9,Отказ10,Отказ11,Отказ12");
	Для Каждого ТекСтрокаДоговорыОПС Из Тз Цикл
		Движение = Движения.ХМ_ПричинаОтказаПФР.Добавить();
		Движение.Период = Дата;
		Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
		Если ТекСтрокаДоговорыОПС.ХМ_Отказ15 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ15;			
		ИначеЕсли  ТекСтрокаДоговорыОПС.Отказ1 Тогда
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ1;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ2 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ2;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ3 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ3;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ4 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ4;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ5 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ5;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ6 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ6;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ7 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ7;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ8 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ8;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ9 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ9;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ10 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ10;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ11 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ11;
		ИначеЕсли ТекСтрокаДоговорыОПС.Отказ12 Тогда 
			Движение.ПричинаОтказаПФР = Перечисления.ХМ_ПричиныОтказаПФР.Отказ12;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
